/*
Post-Deployment Script Template							
--------------------------------------------------------------------------------------
 This file contains SQL statements that will be appended to the build script.		
 Use SQLCMD syntax to include a file in the post-deployment script.			
 Example:      :r .\myfile.sql								
 Use SQLCMD syntax to reference a variable in the post-deployment script.		
 Example:      :setvar TableName MyTable							
               SELECT * FROM [$(TableName)]					
--------------------------------------------------------------------------------------
*/
DELETE FROM dbo.M_VARIANTS;
 insert into [dbo].[M_VARIANTS]
  ([VARIANT_ID]      ,[QUESTION_ID]       ,[TEXT])
VALUES 

(2,	2,	N'"1 байт"'),
(3,	2,	N'"Знаковое 64-бит целое"'),
(4,	2,	N'"Знаковое 8-бит целое"'),
(5,	2,	N'"Знаковое 32-бит целое"'),
(6,	3,	N'"Возвращает остаток от деления"'),
(7,	3,	N'"Возвращает процент от суммы"'),
(8,	3,	N'"Возвращает тригонометрическую функцию"'),
(9,	3,	N'"Ничего из выше перечисленного"'),
(10,	4,	N'"Напишет на новой строчке Hello, World!"'),
(11,	4,	N'"Вырежет слово Hello, World! из всего текста"'),
(12,	4,	N'"Удалит все значения с Hello, World!"'),
(13,	4,	N'"Напишет Hello, World!"'),
(14,	5,	N'"++"'),
(15,	5,	N'"!="'),
(16,	5,	N'"—"'),
(17,	5,	N'"%%"'),
(18,	6,	N'"—"'),
(19,	6,	N'"%%"'),
(20,	6,	N'"!="'),
(21,	6,	N'"++"'),
(22,	7,	N'"Sqrt(x)"'),
(23,	7,	N'"Arifmetic.sqrt"'),
(24,	7,	N'"Summ.Koren(x)"'),
(25,	7,	N'"Math.Sqrt(x)"'),
(26,	8,	N'"!"'),
(27,	8,	N'"No"'),
(28,	8,	N'"!="'),
(29,	8,	N'"Not"'),
(30,	9,	N'"Or"'),
(31,	9,	N'"!="'),
(32,	9,	N'"!"'),
(33,	9,	N'"||"'),
(34,	10,	N'"Все выше перечисленные"'),
(35,	10,	N'"&&"'),
(36,	10,	N'"AND"'),
(37,	10,	N'"&"'),
(38,	11,	N'"2"'),
(39,	11,	N'"11"'),
(40,	11,	N'"1"'),
(41,	11,	N'"3"'),

(42,	12,	N'"4"'),
(43,	12,	N'"False"'),
(44,	12,	N'"True"'),
(45,	12,	N'"3"'),

(46,	13,	N'"Для ветвления программы"'),
(47,	13,	N'"Чтобы были"'),
(48,	13,	N'"Чтобы устанавливать условия пользователю"'),
(49,	13,	N'"Для оптимизации программы"'),

(50,	14,	N'"0"'),
(51,	14,	N'"3"'),
(52,	14,	N'"5"'),
(53,	14,	N'"4"'),

(54,	15,	N'"Территориальный оператор"'),
(55,	15,	N'"Прямой оператор"'),
(56,	15,	N'"Вопросительный"'),
(57,	15,	N'"Тернарный оператор"'),

(58,	16,	N'"Переменная"'),
(59,	16,	N'"Набор текстовых значений в формате Unicode, которые расположены в случайном порядке"'),
(60,	16,	N'"Набор однотипных данных, которые располагаются в памяти последовательно друг за другом"'),
(61,	16,	N'"Набор данных типа int (32-бит целое)"'),

(62,	17,	N'"статичные"'),
(63,	17,	N'"Разнообразные"'),
(64,	17,	N'"Связные"'),
(65,	17,	N'"Одномерные и многомерные"'),

(66,	18,	N'"Циклы нужны чтобы выполнить код без ошибок"'),
(67,	18,	N'"Циклы нужны для многократного размещения данных"'),
(68,	18,	N'"Циклы нужны для многократного запуска программы"'),
(69,	18,	N'"Циклы нужны для многократного выполнения кода"'),

(70,	19,	N'"for, while, do-while, foreach"'),
(71,	19,	N'"ref, out, static, root"'),
(72,	19,	N'"Большие и маленькие"'),
(73,	19,	N'"Цикл, Форич, Двойной цикл, Многократный"'),

(74,	20,	N'"return"'),
(75,	20,	N'"end"'),
(76,	20,	N'"out"'),
(77,	20,	N'"back"'),

(78,	21,	N'"Переменная значение которой нельзя изменить"'),
(79,	21,	N'"Глобальная переменная"'),
(80,	21,	N'"Переменная которая может быть изменена в любое время"'),
(81,	21,	N'"Переменная типа string"'),

(83,	22,	N'"Один раз при первом создании экземпляра класса или при первом обращении к статическим членам класса"'),
(84,	22,	N'"После каждого обращения к статическим полям, методам и свойствам"'),
(85,	22,	N'"Статических конструкторов в C# нет"'),
(86,	22,	N'"Строгий порядок вызова не определен"'),

(87,	23,	N'"Переопределить операторы + и – для делегата"'),
(88,	23,	N'"Использовать ключевые слова get и set"'),
(89,	23,	N'"Для этого существуют специальные ключевые слова add и remove"'),
(90,	23,	N'"Такая возможность не предусмотрена"'),

(91,	24,	N'"Ошибок не произойдет. Переменная j будет иметь значение 5"'),
(92,	24,	N'"Произойдет ошибка времени компиляции"'),
(93,	24,	N'"Значение переменной j предсказать нельзя"'),
(94,	24,	N'Произойдет исключение'),

(95,	25,	N'"Директива #if"'),
(96,	25,	N'"Директива #typedef"'),
(97,	25,	N'"Директива #elseif"'),
(98,	25,	N'"Директива #switch"'),

(99,	26,	N'"namespace System { namespace Customizer { } }"'),
(100,	26,	N'"namespace System { namespace Customizer { } }"'),
(101,	26,	N'"Нельзя создавать собственные пространства имен в пространстве имен System"'),

(102,	27,	N'"Пометить методы, где используется небезопасный код с помощью ключевого слова fixed"'),
(103,	27,	N'"Пометить методы, где используется небезопасный код с помощью ключевого слова unsafe"'),
(104,	27,	N'"Декоратор (Decorator)"'),

(105,	28,	N'"Декоратор (Decorator)"'),
(106,	28,	N'"Посетитель (Visitor)"'),
(107,	28,	N'"Шаблонный метод (Template Method)"'),
(108,	28,	N'"Издатель-подписчик (Publisher-Subscriber)"'),

(109,	29,	N'"Константы инициализируются во время компиляции, доступные только для чтения поля — во время выполнения"'),
(110,	29,	N'"Константы можно изменять, а доступные только для чтения поля нет"'),
(111,	29,	N'"Ничем не отличаются"'),
(112,	29,	N'"Доступные только для чтения поля инициализируются во время компиляции, константы — во время выполнения"'),
(113,	30,	N'"Структуры"'),
(114,	30,	N'"Методы"'),
(115,	30,	N'"Классы"'),
(116,	30,	N'"Все перечисленное можно пометить атрибутом"'),

(117,	31,	N'"CodeDOM"'),
(118,	31,	N'"WebServices"'),
(119,	31,	N'"Interop"'),
(120,	31,	N'"Remoting"')
